---
kind: property
id: P:Autodesk.Revit.DB.Visual.Hardwood.HardwoodApplication
source: html/c6c4daa3-1da4-fd4a-3922-5b60af77f458.htm
---
# Autodesk.Revit.DB.Visual.Hardwood.HardwoodApplication Property

The property labeled "Used For" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public static string HardwoodApplication { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodApplicationType".